Revit 2026 API

# ComboBoxMember Methods

---

The ComboBoxMember type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from RibbonItem) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItem) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button.(Inherited from RibbonItem) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ComboBoxMember Class

Autodesk.Revit.UI Namespace